controllers/FormulirController.php

    public function actionCreate() {
        if (Yii::$app->user->can('create-formulir')) {
            $model = new Formulir();
            $modelUser = User::findOne(Yii::$app->user->getId());
            $formulirUtama = Yii::$app->db->createCommand('SELECT * FROM formulir f INNER JOIN unsur u ON f.IdUnsur=u.IdUnsur  LEFT JOIN formulir_master fm on fm.idFormulirMaster=f.idFormulirMaster where fm.idUser=' . Yii::$app->user->getId() . ' and u.IdJenisUnsur=1')->queryAll();
            $formulirPenunjang = Yii::$app->db->createCommand('SELECT * FROM formulir f LEFT JOIN unsur u ON f.IdUnsur=u.IdUnsur LEFT JOIN formulir_master fm on fm.idFormulirMaster=f.idFormulirMaster where fm.idUser=' . Yii::$app->user->getId() . ' and u.IdJenisUnsur=2')->queryAll();
            if ($model->load(Yii::$app->request->post())) {
                $model->idFormulirMaster = Yii::$app->session['idFB'];
                $model->jenisForm = 'FG';
                $model->save();
---
SELECT * FROM `user` WHERE `id`=69
INSERT INTO `formulir` (`IdUnsur`, `Waktu`, `Kuantitas`, `Output`, `Biaya`, `Mutu`, `AK`, `idFormulirMaster`, `jenisForm`) VALUES (114, 12, 1, 'Sertifikat', 0, 100, 1, 22, 'FG')