views/indikator-nilai/_form.php

    echo Select2::widget([
        'model' => $model,
        'attribute' => 'idIndikator',
        'data' => ArrayHelper::map(\app\models\Indikator::findAll(['idAspek'=>1]), 'idIndikator', 'namaIndikator'),
---
SELECT * FROM `indikator` WHERE `idAspek`=1