views/indikator-nilai/_form_integritas.php

SELECT * FROM `indikator` WHERE `idAspek`=2
---
    echo Select2::widget([
        'model' => $model,
        'attribute' => 'idIndikator',
        'data' => ArrayHelper::map(\app\models\Indikator::findAll(['idAspek'=>2]), 'idIndikator', 'namaIndikator'),