views/formulir/_form.php

SELECT * FROM `jenisunsur`
---
        <?php //echo $form->textField($model, 'kodeBarang', array('size' => 60, 'maxlength' => 255, 'value' => (($model->isNewRecord) ? $model->generateKode() : $model->kodeBarang), 'readonly' => true)); ?>
        <?=

        $form->field(($model->isNewRecord) ? $model:$model->idUnsur,'IdJenisUnsur')->label('Jenis Unsur')->dropDownList(
                ArrayHelper::map(Jenisunsur::find()->all(), 'IdJenisUnsur', 'NamaUnsur'), [
            'prompt' => 'Pilih',
            'onchange' => '
                    $.post( "../unsur/lists?id=' . '"+$(this).val(), function( data ) {
                        $("select#formulir-idunsur" ).html( data );
                    });',
            'style' => 'height:auto;width:auto;'
        ]);

SELECT * FROM `unsur`
---
    </div>
    <div class="col-lg-10">
        <?php
        echo $form->field($model, 'IdUnsur')->label('Unsur')->dropDownList(
                ArrayHelper::map(Unsur::find()->all(), 'IdUnsur', 'NamaUnsur'), [
            'prompt' => '--Pilih Jenis Unsur--',
            'onchange' => '
                        $.post("../unsur/nilai?id=' . '"+$(this).val(), function(data) {
                            $("#formulir-nilai" ).val(data);
                        });',
                //'class' =>'col-xs-12',
        ]);